{
    "infor":{
        "email": "huynhlinh18203@gmail.com",
        "phone": "(+84) 896 454 218",
        "address": "Da Nang, Viet Nam"
    },
    "experience": [
        {
            "id": 1,
            "period": "2021 - 2025",
            "institution": "Danang University of Science and Technology",
            "role": "Majoring in data science and artificial intelligence"
        },
        {
            "id": 2,
            "period": "2023 - now",
            "institution": "Free AI Utilities",
            "role": "Intern mobile developer and front-end developer"
        }
    ],
    "projects": [     
        {
            "id": "01",
            "name": "Pegasus AI",
            "role": "Front-end",
            "description": "Pegasus AI is a multilingual platform designed for businesses and shops looking to create custom support chatbots. These chatbots are trained using the LlamaIndex.ts framework with the Llama3 model, leveraging customer-provided documents to deliver tailored and effective customer interactions.",
            "technologies": "NextJS, Typescript, ShadcnUI, Tailwind CSS, Aceternity UI",
            "tasks": [
                "Integrating with backend APIs for CRUD operations",
                "JWT Authenticate: Handle Access & Refresh Token with Server Components",
                "Embed Chatbot via iFrame",
                "Styling Layouts: Designed and implemented nested and sibling layouts with seamless dark and light mode theme switching"
            ],
            "github": "",
            "image": "/project_image/1.png"
        },{
            "id": "02",
            "name": "Milo",
            "role": "Mobile Developer",
            "description": "Milo is a mobile app that leverages OpenAI technology to help users craft engaging and imaginative stories for children.",
            "technologies": "React Native, Firebase",
            "tasks": [
                "Developed the front-end of the application using React Native",
                "Integrated Firebase for user authentication and data storage",
                "Implemented story generation features using OpenAI’s API"
            ],
            "github": "https://gitlab.com/tranhuutuan261103/bedtime-stories-for-kids",
            "image": "/project_image/3.jpg"
        },
        {
            "id": "03",
            "name": "MelodyHub",
            "role": "Back-end",
            "description": "MelodyHub is a website that supports listening to music online.",
            "technologies": "Django, Firebase",
            "tasks": [
                "Firebase Integration: Store and manage music data, playlists, and user profiles",
                "Spotify Scraping: Collect and update song metadata from Spotify",
                "User Authentication: Implement JWT with Firebase for Access & Refresh Tokens",
                "Playlist Management: Create, update, and manage playlists stored in Firebase"
            ],
            "github": "https://github.com/TranThiHuynhLinh/melody-hub-backend",
            "image": "/project_image/2.jpg"
        },
        {
            "id": "04",
            "name": "Book Station",
            "role": "Front-end & Back-end",
            "description": "Book Station is a vibrant online community where book lovers come together to share their passionate reviews and recommendations.",
            "technologies": "C#, Html, css, Sql Server",
            "tasks": [
                "Implement the UI using HTML and CSS to structure and style the interface",
                "Optimize loading times and resource usage on the front-end.",
                "Crawl data and design database on sql server",
                "Develop repositories or data access classes to interact with the database (CRUD operations)."
            ],
            "github": "https://github.com/TranThiHuynhLinh/BookStation/tree/main",
            "image": "/project_image/4.png"
        }
    ]

}
